tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf1707_tdd.h
#define IOCCP                         522
#define IOCCP0                        523
#define IOCCP1                        524
#define IOCCP2                        525
#define IOCCP3                        526
#define IOCCP4                        527
#define IOCCP5                        528
#define IOCCP6                        529
#define IOCCP7                        530
#define IOCCN                         531
#define IOCCN0                        532
#define IOCCN1                        533
#define IOCCN2                        534
#define IOCCN3                        535
#define IOCCN4                        536
#define IOCCN5                        537
#define IOCCN6                        538
#define IOCCN7                        539
#define IOCCF                         540
#define IOCCF0                        541
#define IOCCF1                        542
#define IOCCF2                        543
#define IOCCF3                        544
#define IOCCF4                        545
#define IOCCF5                        546
#define IOCCF6                        547
#define IOCCF7                        548
#define OPA1CON                       549
#define OPA1PCH                       550
#define OPA1PCH0                      551
#define OPA1PCH1                      552
#define OPA1UG                        553
#define OPA1SP                        554
#define OPA1EN                        555
#define OPA2CON                       556
#define OPA2PCH                       557
#define OPA2PCH0                      558
#define OPA2PCH1                      559
#define OPA2UG                        560
#define OPA2SP                        561
#define OPA2EN                        562
#define PPSLOCK                       563
#define PPSLOCKED                     564
#define INTPPS                        565
#define T0CKIPPS                      566
#define T1CKIPPS                      567
#define T1GPPS                        568
#define CCP1PPS                       569
#define CCP2PPS                       570
#define SSPCLKPPS                     571
#define SSPDATPPS                     572
#define SSPSSPPS                      573
#define RA0PPS                        574
#define RA1PPS                        575
#define RA2PPS                        576
#define RA4PPS                        577
#define RA5PPS                        578
#define RB4PPS                        579
#define RB5PPS                        580
#define RB6PPS                        581
#define RB7PPS                        582
#define RC0PPS                        583
#define RC1PPS                        584
#define RC2PPS                        585
#define RC3PPS                        586
#define RC4PPS                        587
#define RC5PPS                        588
#define RC6PPS                        589
#define RC7PPS                        590
#define ICDBK0H                       591
#define BKA8                          592
#define BKA9                          593
#define BKA10                         594
#define BKA11                         595
#define BKA12                         596
#define BKA13                         597
#define BKA14                         598
#define STATUS_SHAD                   599
#define C_SHAD                        600
#define DC_SHAD                       601
#define Z_SHAD                        602
#define WREG_SHAD                     603
#define BSR_SHAD                      604
#define PCLATH_SHAD                   605
#define FSR0L_SHAD                    606
#define FSR0H_SHAD                    607
#define FSR1L_SHAD                    608
#define FSR1H_SHAD                    609
#define STKPTR                        610
#define TOSL                          611
#define TOSH                          612

#endif // _PIC16LF1707_H_
